# Используем официальный образ n8n как основу
FROM n8nio/n8n:latest

# Устанавливаем рабочую директорию в специальную папку для кастомных данных n8n
WORKDIR /home/node/.n8n

# Копируем наш файл с зависимостями именно в эту директорию
COPY packages.json .

# Переключаемся на пользователя root, чтобы получить права на установку
USER root

# Устанавливаем пакеты из package.json
RUN npm install --production --legacy-peer-deps

# ВАЖНО: Возвращаем права на установленные файлы пользователю node, 
# чтобы n8n мог их читать и использовать
RUN chown -R node:node .

# Возвращаемся к безопасному пользователю node для основного запуска n8n
USER node
